app/controllers/categories_controller.rb

SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = ?  [["category_id", "4"]]
---
  def show
    @subcategories = Subcategory.where(category_id: @category.id.to_s)

INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Eggs"], ["created_at", "2018-08-17 01:15:48.827897"], ["updated_at", "2018-08-17 01:15:48.827897"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save