app/controllers/subcategories_controller.rb

  def index
    @subcategories = Subcategory.all
---
SELECT "subcategories".* FROM "subcategories"

  def create
    @subcategory = Subcategory.new(subcategory_params)

    respond_to do |format|
      if @subcategory.save
---
INSERT INTO "subcategories" ("title", "category_id", "created_at", "updated_at", "path") VALUES (?, ?, ?, ?, ?)  [["title", "Yarn"], ["category_id", "4"], ["created_at", "2018-08-17 01:56:50.088647"], ["updated_at", "2018-08-17 01:56:50.088647"], ["path", "/wool/yarn"]]

  def update
    respond_to do |format|
      if @subcategory.update(subcategory_params)
---
UPDATE "subcategories" SET "path" = ?, "updated_at" = ? WHERE "subcategories"."id" = ?  [["path", "/wool/roving"], ["updated_at", "2018-08-17 01:54:31.209756"], ["id", 1]]

  def set_subcategory
    @subcategory = Subcategory.find(params[:id])
---
SELECT  "subcategories".* FROM "subcategories" WHERE "subcategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]